Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_FLEXSPI_SLV.h
#define FLEXSPI_SLV_MODULE_INTEN_WOFEN_MASK      (0x1U)
#define FLEXSPI_SLV_MODULE_INTEN_WOFEN_SHIFT     (0U)
/*! WOFEN - Write Overflow Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FLEXSPI_SLV_MODULE_INTEN_WOFEN(x)        (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INTEN_WOFEN_SHIFT)) & FLEXSPI_SLV_MODULE_INTEN_WOFEN_MASK)

#define FLEXSPI_SLV_MODULE_INTEN_RUFEN_MASK      (0x2U)
#define FLEXSPI_SLV_MODULE_INTEN_RUFEN_SHIFT     (1U)
/*! RUFEN - Read Underflow Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FLEXSPI_SLV_MODULE_INTEN_RUFEN(x)        (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INTEN_RUFEN_SHIFT)) & FLEXSPI_SLV_MODULE_INTEN_RUFEN_MASK)

#define FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_MASK   (0x4U)
#define FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_SHIFT  (2U)
/*! ERRCMDEN - Error Command Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN(x)     (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_SHIFT)) & FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_MASK)
/*! @} */

/*! @name SPI_MAIL_CTRL - SPI Mailbox control */
/*! @{ */

#define FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_MASK    (0x1U)
#define FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_SHIFT   (0U)
/*! CLRINT - Clear Interrupt
 *  0b0..Do not clear
 *  0b1..Clear
 */
#define FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT(x)      (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_SHIFT)) & FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_MASK)

#define FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_MASK  (0x2U)
#define FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_SHIFT (1U)
/*! SPIINTEN - SPI Leader Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN(x)    (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_SHIFT)) & FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_MASK)
/*! @} */

/*! @name SPIMAIL - SPI Mail Interrupt */
/*! @{ */

#define FLEXSPI_SLV_SPIMAIL_MAILn_MASK           (0xFFFFFFFFU)
#define FLEXSPI_SLV_SPIMAIL_MAILn_SHIFT          (0U)
#define FLEXSPI_SLV_SPIMAIL_MAILn(x)             (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_SPIMAIL_MAILn_SHIFT)) & FLEXSPI_SLV_SPIMAIL_MAILn_MASK)
/*! @} */

/* The count of FLEXSPI_SLV_SPIMAIL */
#define FLEXSPI_SLV_SPIMAIL_COUNT                (9U)


/*!
 * @}
 */ /* end of group FLEXSPI_SLV_Register_Masks */


/*!
 * @}
 */ /* end of group FLEXSPI_SLV_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_FLEXSPI_SLV_H_ */

